app/views/courses/index.html.erb

SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1  [["user_id", 4]]
---
      List
      <% unless current_user.roles.map(&:name).include?('student') %>