app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" WHERE (name LIKE '%%' OR start_time>='2017-06-05' OR end_time<='2017-06-15') LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "courses" WHERE (name LIKE '%%' OR start_time>='2017-06-30' OR end_time<='2017-06-01')
SELECT  "courses".* FROM "courses" ORDER BY "courses"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "courses"
---
  def index
    if params[:commit].eql?('Search')
      if params[:name].blank?
        @courses = Course.where('start_time>=? OR end_time<=?', params[:start_time], params[:end_time]).paginate(:page => params[:page], :per_page => 30)
      else
        @courses = Course.where('name LIKE ? OR start_time>=? OR end_time<=?', "%#{params[:name]}%", params[:start_time], params[:end_time]).paginate(:page => params[:page], :per_page => 30)
      end
    else
      @courses = Course.paginate(:page => params[:page], :per_page => 30)

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @course = Course.find_by_id(params[:id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @course = Course.find_by_id(params[:id])

INSERT INTO "courses" ("instructor_id", "name", "description", "category", "subject", "student_count", "start_time", "end_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @course = current_user.courses.new(permit_params)
    if @course.save

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "courses" SET "subject" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["subject", "for tester"], ["updated_at", "2017-06-05 03:50:34.596749"], ["id", 4]]
---
  def update
    course = Course.find_by_id(params[:id])
    course.update!(permit_params)

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 3]]
---
  def destroy
    course = Course.find_by_id(params[:id])
    redirect_to courses_path if course.destroy

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "enrollments" ("course_id", "user_id") VALUES ($1, $2) RETURNING "id"  [["course_id", 1], ["user_id", 4]]
---
  def enrollment
    course = Course.find(params[:id])
    if course.student_count == course.students.count
      render js: "alert('Sorrey this course is full!')" and return
    end
    enroll = current_user.enrollments.new
    enroll.course = course
    if enroll.save